In [2]:
import numpy as np
import pandas as pd

### 7-2-23

In [3]:
#heirarichal indexing
data=pd.Series(np.random.randn(9),index=[['a','a','a','b','b','b','c','c','c'],[1,2,3,4,5,6,7,8,9,]])

In [4]:
data

a  1   -0.554800
   2    1.334127
   3    2.390541
b  4    0.672640
   5    0.318879
   6    1.149194
c  7    0.845142
   8   -1.690754
   9    0.855031
dtype: float64

In [5]:
data['a']

1   -0.554800
2    1.334127
3    2.390541
dtype: float64

In [6]:
data['b':'c']

b  4    0.672640
   5    0.318879
   6    1.149194
c  7    0.845142
   8   -1.690754
   9    0.855031
dtype: float64

In [7]:
data.loc[:,7]

c    0.845142
dtype: float64

In [8]:
data=pd.Series(np.random.randn(9),index=[['a','a','a','b','b','b','c','c','c'],[1,2,3,1,2,3,1,2,3,]])

In [9]:
data

a  1    0.117926
   2    1.679220
   3   -1.107416
b  1   -0.174022
   2   -1.602076
   3   -2.005822
c  1    1.590820
   2    0.728537
   3    1.549957
dtype: float64

In [12]:
data.loc[:,2]

a    1.679220
b   -1.602076
c    0.728537
dtype: float64

In [13]:
#vertical to horizontal
data.unstack()

          1         2         3
a  0.117926  1.679220 -1.107416
b -0.174022 -1.602076 -2.005822
c  1.590820  0.728537  1.549957

In [14]:
#stack
data.unstack().stack()

a  1    0.117926
   2    1.679220
   3   -1.107416
b  1   -0.174022
   2   -1.602076
   3   -2.005822
c  1    1.590820
   2    0.728537
   3    1.549957
dtype: float64

In [15]:
frame=pd.DataFrame(np.arange(12).reshape(4,3),
                   index=[['a','a','b','b'],[1,2,1,2]],
                   columns=[['aaa','bbb','ccc'],['Greeen','Red','Green']])

In [16]:
frame

       aaa bbb   ccc
    Greeen Red Green
a 1      0   1     2
  2      3   4     5
b 1      6   7     8
  2      9  10    11

### 8-2-23

In [17]:

frame.index.names=['I1','I2']

In [18]:
frame

         aaa bbb   ccc
      Greeen Red Green
I1 I2
a  1       0   1     2
   2       3   4     5
b  1       6   7     8
   2       9  10    11

In [19]:
frame.columns.names=['C1','C2']
frame

C1       aaa bbb   ccc
C2    Greeen Red Green
I1 I2
a  1       0   1     2
   2       3   4     5
b  1       6   7     8
   2       9  10    11

In [20]:
frame['aaa']

C2     Greeen
I1 I2
a  1        0
   2        3
b  1        6
   2        9

In [21]:
#level 2 index will be error
#frame['Greeen']

In [22]:
#reordering
frame.swaplevel('I1','I2')

C1       aaa bbb   ccc
C2    Greeen Red Green
I2 I1
1  a       0   1     2
2  a       3   4     5
1  b       6   7     8
2  b       9  10    11

In [23]:
frame

C1       aaa bbb   ccc
C2    Greeen Red Green
I1 I2
a  1       0   1     2
   2       3   4     5
b  1       6   7     8
   2       9  10    11

In [24]:
frame.sort_index(level=1)

C1       aaa bbb   ccc
C2    Greeen Red Green
I1 I2
a  1       0   1     2
b  1       6   7     8
a  2       3   4     5
b  2       9  10    11

In [27]:
frame.sort_index(level=0)

C1       aaa bbb   ccc
C2    Greeen Red Green
I1 I2
a  1       0   1     2
   2       3   4     5
b  1       6   7     8
   2       9  10    11

In [28]:
frame.swaplevel(0,1).sort_index(level=0)

C1       aaa bbb   ccc
C2    Greeen Red Green
I2 I1
1  a       0   1     2
   b       6   7     8
2  a       3   4     5
   b       9  10    11

In [29]:
frame.swaplevel(0,1).sort_index(level=1)

C1       aaa bbb   ccc
C2    Greeen Red Green
I2 I1
1  a       0   1     2
2  a       3   4     5
1  b       6   7     8
2  b       9  10    11

In [30]:
frame.sum(level='I1')

C:\Users\sweth\AppData\Local\Temp\ipykernel_14156\2878279623.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  frame.sum(level='I1')

C1    aaa bbb   ccc
C2 Greeen Red Green
I1
a       3   5     7
b      15  17    19

In [27]:
#statistic operation by level
frame.sum(level='C1',axis=1)

C:\Users\sweth\AppData\Local\Temp\ipykernel_3116\2517530612.py:2: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  frame.sum(level='C1',axis=1)

C1     aaa  bbb  ccc
I1 I2
a  1     0    1    2
   2     3    4    5
b  1     6    7    8
   2     9   10   11